<a href="https://colab.research.google.com/github/sahil301290/Python-for-Data-Science/blob/main/06_5_Pandas_Combining_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Concatenate and Merge for Combining DataFrames

Official Documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [1]:
import pandas as pd

In [2]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}
one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [3]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [4]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

##Concatenate along rows

In [5]:
axis0 = pd.concat([one,two],axis=0)
axis0

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

##Concatenate along columns

In [6]:
axis1 = pd.concat([one,two],axis=1)
axis1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [7]:
axis1 = pd.concat([two, one],axis=1)
axis1

    C   D   A   B
0  C0  D0  A0  B0
1  C1  D1  A1  B1
2  C2  D2  A2  B2
3  C3  D3  A3  B3

##Axis 0 , but columns match up

In [8]:
two.columns = one.columns
pd.concat([one, two])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [9]:
mydf = pd.concat([one, two])
mydf.index = range(len(mydf))
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

#Inner Merge, Outer Merge, Left and Right Merge

When DataFrames are not in exact same order and we cannot concatenate two DataFrames together, we need to merge the DataFrames.

This is similar to JOIN command in SQL.

Link: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html

pd.merge() function to be used in a key agument labeled 'how'

###inner merge
With how = 'inner', the result will be the set of records that match in both tables.

In [10]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Dhoni','Rohit','Kohli','Sachin']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Yuvraj','Rohit','Bumrah','Kohli']})

In [11]:
registrations

   reg_id    name
0       1   Dhoni
1       2   Rohit
2       3   Kohli
3       4  Sachin

In [12]:
logins

   log_id    name
0       1  Yuvraj
1       2   Rohit
2       3  Bumrah
3       4   Kohli

In [13]:
#help(pd.merge)

In [14]:
pd.merge(registrations, logins, how = 'inner', on = 'name')

   reg_id   name  log_id
0       2  Rohit       2
1       3  Kohli       4

In [15]:
pd.merge(logins, registrations, how = 'inner', on = 'name')

   log_id   name  reg_id
0       2  Rohit       2
1       4  Kohli       3

##left and right merge

Order of the tables passed in as arguments matter in this.

In [16]:
#All values of left argument considered
pd.merge(left = registrations, right = logins, how = 'left', on = 'name')

   reg_id    name  log_id
0       1   Dhoni     NaN
1       2   Rohit     2.0
2       3   Kohli     4.0
3       4  Sachin     NaN

In [17]:
#All values of right argument considered
pd.merge(left = registrations, right = logins, how = 'right', on = 'name')

   reg_id    name  log_id
0     NaN  Yuvraj       1
1     2.0   Rohit       2
2     NaN  Bumrah       3
3     3.0   Kohli       4

##outer merge

Outer Merge grabs all the names from both the tables.

In [18]:
print(registrations)
print(logins)

   reg_id    name
0       1   Dhoni
1       2   Rohit
2       3   Kohli
3       4  Sachin
   log_id    name
0       1  Yuvraj
1       2   Rohit
2       3  Bumrah
3       4   Kohli

In [19]:
pd.merge(registrations, logins, how = 'outer', on = 'name')

   reg_id    name  log_id
0     1.0   Dhoni     NaN
1     2.0   Rohit     2.0
2     3.0   Kohli     4.0
3     4.0  Sachin     NaN
4     NaN  Yuvraj     1.0
5     NaN  Bumrah     3.0

#Join on an Index instead of a Column

In [20]:
registrations = registrations.set_index('name')
registrations

        reg_id
name
Dhoni        1
Rohit        2
Kohli        3
Sachin       4

In [21]:
logins

   log_id    name
0       1  Yuvraj
1       2   Rohit
2       3  Bumrah
3       4   Kohli

Join on registrations 'Index' and logins 'name' column.

In [22]:
pd.merge(registrations, logins, left_index=True, right_on='name', how = 'inner')

   reg_id  log_id   name
1       2       2  Rohit
3       3       4  Kohli

In [23]:
registrations = registrations.reset_index()
registrations

     name  reg_id
0   Dhoni       1
1   Rohit       2
2   Kohli       3
3  Sachin       4

In [24]:
registrations.columns = ['reg_name', 'reg_id']
registrations

  reg_name  reg_id
0    Dhoni       1
1    Rohit       2
2    Kohli       3
3   Sachin       4

In [25]:
logins

   log_id    name
0       1  Yuvraj
1       2   Rohit
2       3  Bumrah
3       4   Kohli

In [26]:
result = pd.merge(registrations, logins, how = 'inner', left_on='reg_name', right_on='name')
result

  reg_name  reg_id  log_id   name
0    Rohit       2       2  Rohit
1    Kohli       3       4  Kohli

In [27]:
result.drop('reg_name', axis = 1)

   reg_id  log_id   name
0       2       2  Rohit
1       3       4  Kohli

In [28]:
registrations.columns = ['name', 'id']

In [29]:
logins.columns = ['id', 'name']

In [30]:
registrations

     name  id
0   Dhoni   1
1   Rohit   2
2   Kohli   3
3  Sachin   4

In [31]:
logins

   id    name
0   1  Yuvraj
1   2   Rohit
2   3  Bumrah
3   4   Kohli

In [32]:
pd.merge(registrations, logins, how = 'inner', on = 'name')

    name  id_x  id_y
0  Rohit     2     2
1  Kohli     3     4

In [33]:
pd.merge(registrations, logins, how = 'inner', on = 'name', suffixes=('_left','_right'))

    name  id_left  id_right
0  Rohit        2         2
1  Kohli        3         4

End of code